maincases/both_400_0313/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver volumetricBSplinesMotionSolver;

volumetricBSplinesMotionSolverCoeffs
{
    duct
    {
        type    cartesian;
        nCPsU   8;
        nCPsV   6;
        nCPsW   3;
        degreeU 3;
        degreeV 3;
        degreeW 2;

        controlPointsDefinition axisAligned;
        lowerCpBounds           (0.05 -0.15  -0.1);
        upperCpBounds           ( 0.9  0.15   1.1);

        confineUMovement false;
        confineVMovement false;
        confineWMovement true;
        confineBoundaryControlPoints true;

        confineUMinCPs ( (true true true) (true true true) );
        confineUMaxCPs ( (true true true) (true true true) );
        confineVMinCPs ( (true true true) );
        confineVMaxCPs ( (true true true) );
    }
}


// ************************************************************************* //
